![png](IMDB_ERD.png)

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
import pandas as pd

## load the cleaned files to view the datatypes and calculate the max length for string/object columns

In [2]:
# Read in the title_basics data and preview
title_basics = pd.read_csv('Data/filtered_data.csv')
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
title_basics["primaryTitle"].str.len().max()

242

In [4]:
# Read in the ratings data and preview
ratings = pd.read_csv('Data/filtered_ratings.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [5]:
ratings["tconst"].str.len().max()

10

## Connect to MySQL database with pandas and sqlalchemy.

In [6]:
# Create the sqlalchemy engine and connection
username = "root"
password = "4221" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "imdb_db"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

## query to show the list of tables

In [7]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_imdb_db
0            genres
1           ratings
2      title_basics
3  title_has_genres

## run a DESCRIBE table command to display the column details

In [8]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [9]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(45)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [10]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(45)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [11]:
q = '''DESCRIBE title_has_genres;'''
describe = pd.read_sql(q, conn)
describe

      Field Type Null  Key Default Extra
0    tconst  int   NO  PRI    None
1  genre_id  int   NO  PRI    None

## Prepare the title_basics and ratings DataFrames for the database

In [12]:
# convert Living  to int
title_basics['startYear'].astype(int)

0        2001
1        2020
2        2018
3        2005
4        2002
         ...
86974    2019
86975    2019
86976    2019
86977    2020
86978    2020
Name: startYear, Length: 86979, dtype: int32

In [13]:
# extrat the columns needed from title_basics
basics = title_basics[['tconst','primaryTitle', 'startYear', 'runtimeMinutes']]

In [14]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   primaryTitle    86979 non-null  object
 2   startYear       86979 non-null  float64
 3   runtimeMinutes  86979 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.7+ MB

In [15]:
# Rename columns to match SQL table
rename_map = {"primaryTitle":"primary_title",
             "startYear":"start_year",
             "runtimeMinutes":"runtime"}
basics = basics.rename(rename_map,axis=1)
basics.head(2)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70

In [16]:
# Rename columns to match SQL table
rename_map2 = {"averageRating":"average_rating",
             "numVotes":"number_of_votes"}
ratings = ratings.rename(rename_map2,axis=1)
ratings.head(2)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175

## Use df.to_sql to append the data to the correct tables

In [17]:
# basics insert
basics.to_sql("title_basics",conn,index=False, if_exists='append')

86979

In [18]:
# ratings insert
ratings.to_sql("ratings",conn,index=False, if_exists='append')

71900

## Confirm the Database has been updated correctly

In [19]:
# testing the tables
q = '''SHOW TABLES;'''
pd.read_sql(q,conn)

  Tables_in_imdb_db
0            genres
1           ratings
2      title_basics
3  title_has_genres

### confirm the data types have not changed.

In [20]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(45)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [21]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(45)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

### preview the first 5 rows from each table

In [22]:
q = '''SELECT * FROM title_basics LIMIT 5;'''
preview = pd.read_sql(q, conn)
preview

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [23]:
q = '''SELECT * FROM ratings LIMIT 5;'''
preview = pd.read_sql(q, conn)
preview

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [24]:
q = '''SELECT * FROM genres LIMIT 5;'''
preview = pd.read_sql(q, conn)
preview

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

In [25]:
q = '''SELECT * FROM title_has_genres LIMIT 5;'''
preview = pd.read_sql(q, conn)
preview

Empty DataFrame
Columns: [tconst, genre_id]
Index: []